Ma7m0ud3id/Embedded_System/Embedded_System_diploma/Unit8_MCU_Interfacing/I2C/I2C_Driver_STM32F103C6/Drivers/Stm32_F103C6_Drivers/I2C/Stm32f103x8_I2C_drivers.c
/**================================================================
 * @Fn			-MCAL_I2C_Master_Tx
 * @brief 		-Master transmit data
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-Device_Address: it is the address of the slave that we need to send the data to it
 * @param [in] 	-*Data_Out: it is a pointer to the data that we need to send it
 * @param [in] 	-Data_Length: it is the length of the data that we need to send it
 * @param [in] 	-stop: it is determine that we need to end with stop condition or not
 * @param [in] 	-start: it is determine that we send start or repeated start
 * @retval 		-none
 * Note			-none
================================================================**/
void MCAL_I2C_Master_Tx(I2C_TypeDef *I2Cx, uint16_t Device_Address, uint8_t *Data_Out, uint16_t Data_Length, Stop_Generation stop, Start_State start)
{
	int i = 0;

	/* To Do:
	 * Support timeout (configure timer working for specific duration and then rise interrupt)
	 * timer_interrupt() { flag = 1}
	 * so any code exist in while should (check flag || check any polling conditions)
	 */

	//*******************************************************************************
	//1.Send Start Condition to switch the device from slave to master
	I2C_Generate_Start_Condition(I2Cx, Fun_enable, Start);
	//*******************************************************************************

	//*******************************************************************************
	//2.Wait for Event5
	//EV5: SB=1, cleared by reading SR1 register followed by writing DR register with Address
	while(!(I2C_Get_Flag_Status(I2Cx, EV5)));
	//*******************************************************************************

	//*******************************************************************************
	//3.Send Device Address
	I2C_Send_Address(I2Cx, Device_Address, I2C_Direction_Transimitter);
	//*******************************************************************************

	//*******************************************************************************
	//4.Wait for Event6
	//EV6: ADDR=1, cleared by reading SR1 register followed by reading SR2.
	while(!(I2C_Get_Flag_Status(I2Cx, EV6)));
	//*******************************************************************************

	//*******************************************************************************
	//5.Check	--> TRA: Transmitter/receiver
	//			--> BUSY: bus is busy or not
	//			--> MSL: Master/slave Mode
	//			--> TXE:  Data register empty
	while(!(I2C_Get_Flag_Status(I2Cx, MASTER_BYTE_TRANSMITTING)));
	//*******************************************************************************

	//*******************************************************************************
	//6.Write Data in DR
	for(i = 0; i < Data_Length; i++)
	{
		I2Cx->DR = Data_Out[i];

		//*******************************************************************************
		//7.Wait for Event8
		//EV8: TxE=1, shift register not empty, d. ata register empty, cleared by writing DR register
		while(!(I2C_Get_Flag_Status(I2Cx, EV8)));
		//*******************************************************************************
	}
	//*******************************************************************************

	//*******************************************************************************
	//8.Stop Condition
	if(stop == With_Stop)
	{
		I2C_Generate_Stop_Condition(I2Cx, Fun_enable);
	}
	//*******************************************************************************
}

/**================================================================
 * @Fn			-MCAL_I2C_Master_Rx
 * @brief 		-Master receive data
 * @param [in] 	-I2Cx: it is an instance from I2C (x --> 1..2)
 * @param [in] 	-Device_Address: it is the address of the slave that we need to send the data to it
 * @param [in] 	-*Data_Out: it is a pointer that we use it to point to the data
 * @param [in] 	-Data_Length: it is the length of the data that we need to receive it
 * @param [in] 	-stop: it is determine that we need to end with stop condition or not
 * @param [in] 	-start: it is determine that we send start or repeated start
 * @retval 		-none
 * Note			-none
================================================================**/
void MCAL_I2C_Master_Rx(I2C_TypeDef *I2Cx, uint16_t Device_Address, uint8_t *Data_Out, uint16_t Data_Length, Stop_Generation stop, Start_State start)
{
	int i = 0;
	uint8_t Index = (I2Cx == I2C1)? I2C1_INDEX : I2C2_INDEX;

	//*******************************************************************************
	//1.Send Start Condition to switch the device from slave to master
	I2C_Generate_Start_Condition(I2Cx, Fun_enable, start);
	//*******************************************************************************

	//*******************************************************************************
	//2.Wait for Event5
	//EV5: SB=1, cleared by reading SR1 register followed by writing DR register with Address
	while(!(I2C_Get_Flag_Status(I2Cx, EV5)));
	//*******************************************************************************

	//*******************************************************************************
	//3.Send Device Address
	I2C_Send_Address(I2Cx, Device_Address, I2C_Direction_Receiver);
	//*******************************************************************************

	//*******************************************************************************
	//4.Wait for Event6
	//EV6: ADDR=1, cleared by reading SR1 register followed by reading SR2.
	while(!(I2C_Get_Flag_Status(I2Cx, EV6)));
	//*******************************************************************************

	I2C_Acknowledge_Config(I2Cx, Fun_enable);

	/* Check Data length because if it is equal zero we won't receive any thing */
	if(Data_Length)
	{
		for(i = Data_Length; i > 1; i--)
		{
			//*******************************************************************************
			//5.Wait for Event7
			//EV7: RxNE = 1 cleared by reading DR register
			while(!(I2C_Get_Flag_Status(I2Cx, EV7)));
			//*******************************************************************************

			//*******************************************************************************
			//6.Read Data from DR
			*Data_Out = I2Cx->DR;
			Data_Out++;
			//*******************************************************************************
		}

